app/controllers/products_controller.rb

  def index
    @products = Product.all.order('created_at DESC')
---
SELECT "products".* FROM "products"  ORDER BY created_at DESC

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "price", "stock", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Samsung S6 plus"], ["price", 345.99], ["stock", 5], ["created_at", "2016-02-03 16:27:32.884335"], ["updated_at", "2016-02-03 16:27:32.884335"]]

  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "products" SET "name" = $1, "image_url" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["name", "Samsung S6 "], ["image_url", "http://pages.samsung.com/ca/gs6/common/images/galaxy-s6-white.png"], ["updated_at", "2016-02-06 23:24:08.973550"], ["id", 2]]

  def checkout
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 4]]

  def buy
   @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 5]]